ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U335.svd
        <register>
          <name>EXTI_FTSR1</name>
          <displayName>EXTI falling trigger selection register</displayName>
          <description>This register contains only bits for configurable events.</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FT0</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT1</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT2</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT3</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT4</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT5</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT6</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT7</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT8</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT9</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT10</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT11</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT12</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT13</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT14</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT15</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT16</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT17</name>
              <description>Falling trigger event configuration bit of configurable event input i
