ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U335.svd
        <register>
          <name>EXTI_SWIER1</name>
          <displayName>EXTI software interrupt event register</displayName>
          <description>This register contains only bits for configurable events.</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWI0</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI1</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI2</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI3</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI4</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI5</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI6</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI7</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI8</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI9</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI10</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI11</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI12</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI13</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI14</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI15</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI16</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
