ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U335.svd
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI17</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI18</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI19</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI20</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI21</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI22</name>
              <description>Software interrupt on event i
When EXTI_SECCFGR.SECi is disabled, SWIi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, SWIi can only be accessed with secure access. Nonsecure write to this SWIi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, SWIi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SWIi can only be accessed with privileged access. Unprivileged write to this SWIi is discarded, unprivileged read returns 0.
A software interrupt is generated independent from the setting in EXTI_RTSR and EXTI_FTSR. It always returns 0 when read.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing 1 triggers a rising edge event on event i. This bit is auto cleared by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
