ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U335.svd
              <description>CPU wake-up with event generation mask on event input i
When EXTI_SECCFGR.SECi is disabled, EMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, EMi can only be accessed with secure access. Nonsecure write to this EMi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, EMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, EMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with event generation from line i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with event generation from line i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM19</name>
              <description>CPU wake-up with event generation mask on event input i
When EXTI_SECCFGR.SECi is disabled, EMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, EMi can only be accessed with secure access. Nonsecure write to this EMi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, EMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, EMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with event generation from line i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with event generation from line i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM20</name>
              <description>CPU wake-up with event generation mask on event input i
When EXTI_SECCFGR.SECi is disabled, EMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, EMi can only be accessed with secure access. Nonsecure write to this EMi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, EMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, EMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with event generation from line i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with event generation from line i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM21</name>
              <description>CPU wake-up with event generation mask on event input i
When EXTI_SECCFGR.SECi is disabled, EMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, EMi can only be accessed with secure access. Nonsecure write to this EMi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, EMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, EMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with event generation from line i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with event generation from line i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM22</name>
              <description>CPU wake-up with event generation mask on event input i
When EXTI_SECCFGR.SECi is disabled, EMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, EMi can only be accessed with secure access. Nonsecure write to this EMi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, EMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, EMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with event generation from line i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with event generation from line i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
