ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U335.svd
        <register>
          <name>FLASH_SBOOT0R</name>
          <displayName>FLASH secure boot address 0 register</displayName>
          <description>This register can not be written if OPTLOCK bit is set.
This register is secure. It can be read and written only by secure access. A nonsecure read/write access is RAZ/WI. This register can be protected against unprivileged access when SPRIV = 1 in FLASH_PRIVCFGR register.
ST production value: 0x0C00 007C
(option bytes are loaded with values from the flash memory at reset release)</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOT_LOCK</name>
              <description>Boot lock
When set, the boot is always forced to base address value programmed in ADD[24:0] option bytes, whatever the boot selection option. When set, this bit can only be cleared when RDP is at level 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Secure boot base address 0
The secure boot memory address can be programmed to any address in the valid address range with a granularity of 128 bytes. This bits correspond to address [31:7] ADD option bytes are selected following the BOOT0 pin or NSWBOOT0 state. 
Examples:
ADD[24:0] = 0x018 0000: Boot from secure flash memory (0x0C00 0000)
ADD[24:0] = 0x01F F000: Boot from RSS (0x0FF8 0000)
ADD[24:0] = 0x060 0000: Boot from secure SRAM1 on S-Bus (0x3000 0000)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM1R1</name>
          <displayName>FLASH secure watermark1 register 1</displayName>
          <description>This register can not be written if OPTLOCK bit is set.
This register is secure. It can be read and written only by secure access. A nonsecure read/write access is RAZ/WI. This register can be protected against unprivileged access when SPRIV = 1 in FLASH_PRIVCFGR register.
ST production value:
- 0xFFFF FF80 (for STM32U375/385)
- 0xFFFF FF00 (for STM32U3B5/3C5)
(register bits are loaded with values from the flash memory at OBL. Reserved bits are read as 1.)</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF00FF00</resetValue>
          <resetMask>0xFF00FF00</resetMask>
          <fields>
            <field>
              <name>SECWM1_STRT</name>
              <description>Start page of first secure area
This bit field contains the first page of the secure area in bank 1.
Note: SECWM1_STRT[7] is reserved for STM32U375/385.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECWM1_END</name>
              <description>End page of first secure area
This bit field contains the last page of the secure area in bank 1.
Note: SECWM1_END[7] is reserved for STM32U375/385.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM1R2</name>
          <displayName>FLASH secure watermark1 register 2</displayName>
          <description>This register can not be written if OPTLOCK bit is set.
This register is secure. It can be read and written only by secure access. A nonsecure read/write access is RAZ/WI. This register can be protected against unprivileged access when SPRIV = 1 in FLASH_PRIVCFGR register.
ST production value:
- 0xB480 FFFF (for STM32U375/385)
- 0xB400 FFFF (for STM32U3B5/3C5)
(register bits are loaded with values from the flash memory at OBL)</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>HDP1_END</name>
              <description>End page of first hide protection area
This bit field contains the last page of the HDP area in bank 1.
Note: HDP1_END[7] is reserved for STM32U375/385</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDP1EN</name>
              <description>Hide protection first area enable
others: HDP first area enabled</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xB4</name>
                  <description>No HDP area 1</description>
                  <value>0xB4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP1AR</name>
          <displayName>FLASH WRP1 area A address register</displayName>
          <description>This register can not be written if OPTLOCK bit is set.
This register is nonsecure. It can be read and written by both secure and nonsecure access. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.
ST production value:
- 0xFF80 FFFF (for STM32U375/385)
- 0xFF00 FFFF (forSTM32U3B5/3C5)
(register bits are loaded with values from the flash memory at OBL. Reserved bits are read as 1)</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0F00FF00</resetValue>
          <resetMask>0x0F00FF00</resetMask>
          <fields>
            <field>
              <name>STRT</name>
              <description>Bank 1 WPR first area A start page
This bit field contains the first page of the first WPR area for bank 1.
Note: STRT[7] is reserved for STM32U375/385.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>END</name>
              <description>Bank 1 WPR first area A end page
This bit field contains the last page of the first WPR area in bank 1.
Note: END[7] is reserved for STM32U375/385.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>Bank 1 WPR first area A unlock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WRP1A start and end pages locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WRP1A start and end pages unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP1BR</name>
          <displayName>FLASH WRP1 area B address register</displayName>
          <description>This register can not be written if OPTLOCK bit is set.
This register is nonsecure. It can be read and written by both secure and nonsecure access. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.
ST production value:
- 0xFF80 FFFF (for STM32U375/385)
- 0xFF00 FFFF (forSTM32U3B5/3C5)
(register bits are loaded with values from the flash memory at OBL)</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0F00FF00</resetValue>
          <resetMask>0x0F00FF00</resetMask>
          <fields>
            <field>
              <name>STRT</name>
              <description>Bank 1 WRP second area B start page
This bit field contains the first page of the second WRP area for bank 1.
Note: STRT[7] is reserved for STM32U375/385.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>END</name>
              <description>Bank 1 WRP second area B end page
This bit field contains the last page of the second WRP area in bank 1.
Note: END[7] is reserved for STM32U375/385.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>Bank 1 WPR second area B unlock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WRP1B start and end pages locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WRP1B start and end pages unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM2R1</name>
          <displayName>FLASH secure watermark2 register 1</displayName>
          <description>This register can not be written if OPTLOCK bit is set.
This register is secure. It can be read and written only by secure access. A nonsecure read/write access is RAZ/WI. This register can be protected against unprivileged access when SPRIV = 1 in FLASH_PRIVCFGR register.
ST production value:
- 0xFFFF FF80 (for STM32U375/385)
- 0xFFFF FF00 (forSTM32U3B5/3C5)
(register bits are loaded with values from the flash memory at OBL)</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF00FF00</resetValue>
          <resetMask>0xFF00FF00</resetMask>
          <fields>
            <field>
              <name>SECWM2_STRT</name>
              <description>Start page of second secure area
This bit field contains the first page of the secure area in bank 2.
Note: SECWM2_STRT[7] is reserved for STM32U375/385.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECWM2_END</name>
              <description>End page of second secure area
This bit field contains the last page of the secure area in bank 2.
Note: SECWM2_END[7] is reserved for STM32U375/385.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM2R2</name>
          <displayName>FLASH secure watermark2 register 2</displayName>
          <description>This register can not be written if OPTLOCK bit is set.
This register is secure. It can be read and written only by secure access. A nonsecure read/write access is RAZ/WI. This register can be protected against unprivileged access when SPRIV = 1 in FLASH_PRIVCFGR register.
ST production value:
- 0xB480 FFFF (for STM32U375/385)
- 0xB400 FFFF (forSTM32U3B5/3C5)
(register bits are loaded with values from the flash memory at OBL)</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>HDP2_END</name>
              <description>End page of hide protection second area
This bit field contains the last page of the HDP area in bank 2.
Note: HDP2_END[7] is reserved for STM32U375/385.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDP2EN</name>
              <description>Hide protection second area enable
others: HDP second area is enabled.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xB4</name>
                  <description>No HDP area 2</description>
                  <value>0xB4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP2AR</name>
          <displayName>FLASH WPR2 area A address register</displayName>
          <description>This register can not be written if OPTLOCK bit is set.
This register is nonsecure. It can be read and written by both secure and nonsecure access. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.
ST production value:
- 0xFF80 FFFF (for STM32U375/385)
- 0xFF00 FFFF (forSTM32U3B5/3C5)
(register bits are loaded with values from the flash memory at OBL)</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0F00FF00</resetValue>
          <resetMask>0x0F00FF00</resetMask>
          <fields>
            <field>
              <name>STRT</name>
              <description>Bank 2 WPR first area A start page
This bit field contains the first page of the first WRP area for bank 2.
Note: STRT[7] is reserved for STM32U375/385.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>END</name>
              <description>Bank 2 WPR first area A end page
This bit field contains the last page of the first WRP area in bank 2.
Note: END[7] is reserved for STM32U375/385.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>Bank 2 WPR first area A unlock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WRP2A start and end pages locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WRP2A start and end pages unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP2BR</name>
          <displayName>FLASH WPR2 area B address register</displayName>
          <description>This register can not be written if OPTLOCK bit is set.
This register is nonsecure. It can be read and written by both secure and nonsecure access. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.
ST production value:
- 0xFF80 FFFF (for STM32U375/385)
- 0xFF00 FFFF (for STM32U3B5/3C5)
(register bits are loaded with values from the flash memory at OBL)</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0F00FF00</resetValue>
          <resetMask>0x0F00FF00</resetMask>
          <fields>
            <field>
              <name>STRT</name>
              <description>Bank 2 WPR second area B start page
This bit field contains the first page of the second WRP area for bank 2.
Note: STRT[7] is reserved for STM32U375/385.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>END</name>
              <description>Bank 2 WPR second area B end page
This bit field contains the last page of the second WRP area in bank 2.
Note: END[7] is reserved for STM32U375/385.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>Bank 2 WPR second area B unlock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WRP2B start and end pages locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WRP2B start and end pages unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
