ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U335.svd
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 accessible by unprivileged access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 only accessible by privileged access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV26</name>
              <description>Page privileged/unprivileged attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 accessible by unprivileged access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 only accessible by privileged access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV27</name>
              <description>Page privileged/unprivileged attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 accessible by unprivileged access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 only accessible by privileged access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV28</name>
              <description>Page privileged/unprivileged attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 accessible by unprivileged access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 only accessible by privileged access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV29</name>
              <description>Page privileged/unprivileged attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 accessible by unprivileged access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 only accessible by privileged access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV30</name>
              <description>Page privileged/unprivileged attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 accessible by unprivileged access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 only accessible by privileged access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV31</name>
              <description>Page privileged/unprivileged attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 accessible by unprivileged access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 only accessible by privileged access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM1KEYR1</name>
          <displayName>FLASH OEM1 key register 1</displayName>
          <description>This register is nonsecure. It can be written by both secure and nonsecure access. This register is read as zero. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM1KEY</name>
              <description>OEM1[31:0] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM1KEYR2</name>
          <displayName>FLASH OEM1 key register 2</displayName>
          <description>This register is nonsecure. It can be written by both secure and nonsecure access. This register is read as zero. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM1KEY</name>
              <description>OEM1[63:32] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM1KEYR3</name>
          <displayName>FLASH OEM1 key register 3</displayName>
          <description>This register is nonsecure. It can be written by both secure and nonsecure access. This register is read as zero. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM1KEY</name>
              <description>OEM1[95:64] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM1KEYR4</name>
          <displayName>FLASH OEM1 key register 4</displayName>
          <description>This register is nonsecure. It can be written by both secure and nonsecure access. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM1KEY</name>
              <description>OEM1[127:96] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM2KEYR1</name>
          <displayName>FLASH OEM2 key register 1</displayName>
          <description>This register is nonsecure. It can be written by both secure and nonsecure access. This register is read as zero. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM2KEY</name>
              <description>OEM2[31:0] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM2KEYR2</name>
          <displayName>FLASH OEM2 key register 2</displayName>
          <description>This register is nonsecure. It can be written by both secure and nonsecure access. This register is read as zero. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM2KEY</name>
              <description>OEM2[63:32] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM2KEYR3</name>
          <displayName>FLASH OEM2 key register 3</displayName>
          <description>This register is nonsecure. It can be written by both secure and nonsecure access. This register is read as zero. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM2KEY</name>
              <description>OEM2[95:64] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM2KEYR4</name>
          <displayName>FLASH OEM2 key register 4</displayName>
          <description>This register is nonsecure. It can be written by both secure and nonsecure access. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM2KEY</name>
              <description>OEM2[127:96] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEMKEYSR</name>
          <displayName>FLASH OEM key status register</displayName>
          <description>This register is nonsecure. It can be read by both secure and nonsecure access. This register can be protected against unprivileged access when PRIV = 1 in FLASH_PRIVCFGR register.</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF00FF00</resetMask>
          <fields>
            <field>
              <name>OEM1KEYCRC</name>
              <description>8-bit OEMKEY1 CRC
CRC is automatically computed by hardware while loading the OEM1KEY key. The CRC computation is an 8-bit checksum using the standard CRC-8-CCITT algorithm X8 + X2 + X + 1 (according the convention). Source code is available in OEM Key CRC source.
Note: CRC information is updated each time FLASH OEM1KEY registers are written</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OEM2KEYCRC</name>
              <description>8-bit OEM2KEY CRC
CRC is automatically computed by hardware while loading the OEM2KEYkey. The CRC computation is an 8-bit checksum using the standard CRC-8-CCITT algorithm X8 + X2 + X + 1 (according the convention). Source code is available in OEM Key CRC source.
Note: CRC information is updated each time FLASH OEM2KEY registers are written</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
