ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U335.svd
        <register>
          <name>GPDMA_C3TR2</name>
          <displayName>GPDMA_C3TR2</displayName>
          <description>GPDMA channel 3 transfer register 2 </description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQSEL</name>
              <description>These bits are ignored if channel 3 is activated (GPDMA_C3CR.EN asserted) with SWREQ=1 (software request for a memory-to-memory transfer). Else, the selected hardware request is internally taken into account as per  less than xe4 [GPDMA_requests]/&gt;.
The user must not assign a same input hardware request (same REQSEL[6:0] value) to different active GPDMA channels (GPDMA_C3CR.EN = 1 and GPDMA_C3TR2.SWREQ = 0 for these channels). GPDMA is not intended to hardware support the case of simultaneous enabled channels incorrectly configured with a same hardware peripheral request signal, and there is no user setting error reporting.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ</name>
              <description>This bit is internally taken into account when GPDMA_C3CR.EN is asserted.
0: no software request. The selected hardware request REQSEL[6:0] is taken into account.
1: software request for a memory-to-memory transfer. The default selected hardware request as per REQSEL[6:0] is ignored.
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no software request. The selected hardware request REQSEL[6:0] is taken into account.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>software request for a memory-to-memory transfer. The default selected hardware request as per REQSEL[6:0] is ignored.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DREQ</name>
              <description>This bit is ignored if channel 3 is activated (GPDMA_C3CR.EN asserted) with SWREQ = 1 (software request for a memory-to-memory transfer). Else:
0: selected hardware request driven by a source peripheral (request signal taken into account by the GPDMA transfer scheduler over the source/read port)
1: selected hardware request driven by a destination peripheral (request signal taken into account by the GPDMA transfer scheduler over the destination/write port)
Note: If the channel 3 is activated (GPDMA_C3CR.EN is asserted) with SWREQ = 0 and PFREQ = 1 (peripheral hardware request with peripheral flow-control mode), any software assertion to this DREQ bit is ignored: in peripheral flow-control mode, only a peripheral-to-memory transfer is supported.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>selected hardware request driven by a source peripheral (request signal taken into account by the GPDMA transfer scheduler over the source/read port)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>selected hardware request driven by a destination peripheral (request signal taken into account by the GPDMA transfer scheduler over the destination/write port)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BREQ</name>
              <description>If the channel 3 is activated (GPDMA_C3CR.EN asserted) with SWREQ = 1 (software request for a memory-to-memory transfer), this bit is ignored. Else:
0: the selected hardware request is driven by a peripheral with a hardware request/acknowledge protocol at a burst level.
1: the selected hardware request is driven by a peripheral with a hardware request/acknowledge protocol at a block level (see  less than xe4 [GPDMA_requests]/&gt;).
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>the selected hardware request is driven by a peripheral with a hardware request/acknowledge protocol at a burst level.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>the selected hardware request is driven by a peripheral with a hardware request/acknowledge protocol at a block level (see  less than xe4 [GPDMA_requests]/&gt;).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFREQ</name>
              <description>Caution: If a given channel 3 is not implemented with this feature, this bit is reserved and PFREQ is not present (see  less than xe1 [GPDMA_channels]/&gt; for the list of the implemented channels with this feature).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>the selected hardware request is driven by a peripheral with a hardware request/acknowledge protocol in GPDMA control mode. The GPDMA is programmed with GPDMA_C3TR1.BNDT[15:0] and this is internally used by the hardware for the block transfer completion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>the selected hardware request is driven by a peripheral with a hardware request/acknowledge protocol in peripheral control mode. The GPDMA block transfer can be early completed by the peripheral itself (see  less than xe2 [GPDMA_channels_peripheral]/&gt; for more details).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGM</name>
              <description>These bits define the transfer granularity for its conditioning by the trigger.
If the channel 3 is enabled (GPDMA_C3CR.EN asserted) with TRIGPOL[1:0] = 00 or 11, these TRIGM[1:0] bits are ignored.
Else, a GPDMA transfer is conditioned by at least one trigger hit: 
00: at block level: the first burst read of each block transfer is conditioned by one hit trigger (channel 3 = 12 to 15, for each block if a 2D/repeated block is configured with GPDMA_C3BR1.BRC[10:0] is not equal to  0).
10: at link level: a LLI link transfer is conditioned by one hit trigger. The LLI data transfer (if any) is not conditioned.
11: at programmed burst level: If SWREQ = 1, each programmed burst read is conditioned by one hit trigger. If SWREQ = 0, each programmed burst that is requested by the selected peripheral, is conditioned by one hit trigger.
- If the peripheral is programmed as a source (DREQ = 0) of the LLI data transfer, each programmed burst read is conditioned.
- If the peripheral is programmed as a destination (DREQ = 1) of the LLI data transfer, each programmed burst write is conditioned. The first memory burst read of a (possibly 2D/repeated) block, also named as the first ready FIFO-based source burst, is gated by the occurrence of both the hardware request and the first trigger hit.01: channel 3 = 0 to , same as 00; channel 3 , at 2D/repeated block level. The first burst read of a 2D/repeated block transfer is conditioned by one hit trigger.
The GPDMA monitoring of a trigger for channel 3 is started when the channel is enabled/loaded with a new active trigger configuration: rising or falling edge on a selected trigger (TRIGPOL[1:0] = 01 or respectively TRIGPOL[1:0]=10).
The monitoring of this trigger is kept active during the triggered and uncompleted (data or link) transfer; and if a new trigger is detected then, this hit is internally memorized to grant the next transfer, as long as the defined rising or falling edge is not modified, and the TRIGSEL[5:0] is not modified, and the channel is enabled.
Transferring a next LLIn+1 that updates the GPDMA_C3TR2 with a new value for any of TRIGSEL[5:0] or TRIGPOL[1:0], resets the monitoring, trashing the memorized hit of the formerly defined LLIn trigger.
After a first new trigger hitn+1 is memorized, if another second trigger hitn+2 is detected and if the hitn triggered transfer is still not completed, hitn+2 is lost and not memorized.memorized. A trigger overrun flag is reported (GPDMA_C3SR.TOF=1), and an interrupt is generated if enabled (GPDMA_C3CR.TOIE = 1). The channel is not automatically disabled by hardware due to a trigger overrun. 
Note: When the source block size is not a multiple of the source burst size and is a multiple of the source data width, then the last programmed source burst is not completed and is internally shorten to match the block size. In this case, if TRIGM[1:0] = 11 and (SWREQ = 1 or (SWREQ = 0 and DREQ = 0)), the shortened burst transfer (by singles or/and by bursts of lower length) is conditioned once by the trigger.
+: When the programmed destination burst is internally shortened by singles or/and by bursts of lower length (versus FIFO size, versus block size, 1-Kbyte boundary address crossing): if the trigger is conditioning the programmed destination burst (if TRIGM[1:0] = 11 and SWREQ = 0 and DREQ = 1), this shortened destination burst transfer is conditioned once by the trigger.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGSEL</name>
              <description>These bits select the trigger event input of the GPDMA transfer (as per  less than xe3 [GPDMA_triggers]/&gt;), with anactive trigger event if TRIGPOL[1:0] is not equal to 00.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGPOL</name>
              <description>These bits define the polarity of the selected trigger event input defined by TRIGSEL[5:0].
00: no trigger (masked trigger event) 
01: trigger on the rising edge
10: trigger on the falling edge
11: same as 00
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no trigger (masked trigger event)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>trigger on the rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>trigger on the falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>same as 00</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCEM</name>
              <description>These bits define the transfer granularity for the transfer complete and half transfer complete events generation.
00: at block level (when GPDMA_C3BR1.BNDT[15:0] = 0): the complete (and the half) transfer event is generated at the (respectively half of the) end of a block. 
01: channel 3 (0 to ), same as 00, channel 3 , at 2D/repeated block level (when GPDMA_C3BR1.BRC[10:0] = 0 and GPDMA_C3BR1.BNDT[15:0] = 0). The complete (and the half) transfer event is generated at the end (respectively half of the end) of the 2D/repeated block.
10: at LLI level: the complete transfer event is generated at the end of the LLI transfer, including the update of the LLI if any. The half transfer event is generated at the half of the LLI data transfer. The LLI data transfer is a block transfer or a 2D/repeated block transfer for channel 3 , if any data transfer.
11: at channel level: the complete transfer event is generated at the end of the last LLI transfer. The half transfer event is generated at the half of the data transfer of the last LLI. The last LLI updates the link address GPDMA_C3LLR.LA[15:2] to zero and clears all the GPDMA_C3LLR update bits (UT1, UT2, UB1, USA, UDA and ULL, plus UT3 and UB2). If the channel transfer is continuous/infinite, no event is generated.
Note: If the initial LLI0 data transfer is null/void (directly programmed by the internal register file with GPDMA_C3BR1.BNDT[15:0] = 0), then neither the complete transfer event nor the half transfer event is generated.
+: If the initial LLI0 data transfer is null/void (directly programmed by the internal register file with GPDMA_C3BR1.BNDT[15:0] = 0), then neither the complete transfer event nor the half transfer event is generated.
+: If the initial LLI0 data transfer is null/void (directly programmed by the internal register file with GPDMA_C3BR1.BNDT[15:0] =  0), then the half transfer event is not generated, and the transfer complete event is generated when is completed the loading of the LLI1.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>at block level (when GPDMA_C3BR1.BNDT[15:0] = 0): the complete (and the half) transfer event is generated at the (respectively half of the) end of a block.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>channel 3 (0 to ), same as 00, channel 3 , at 2D/repeated block level (when GPDMA_C3BR1.BRC[10:0] = 0 and GPDMA_C3BR1.BNDT[15:0] = 0). The complete (and the half) transfer event is generated at the end (respectively half of the end) of the 2D/repeated block.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>at LLI level: the complete transfer event is generated at the end of the LLI transfer, including the update of the LLI if any. The half transfer event is generated at the half of the LLI data transfer. The LLI data transfer is a block transfer or a 2D/repeated block transfer for channel 3 , if any data transfer.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>at channel level: the complete transfer event is generated at the end of the last LLI transfer. The half transfer event is generated at the half of the data transfer of the last LLI. The last LLI updates the link address GPDMA_C3LLR.LA[15:2] to zero and clears all the GPDMA_C3LLR update bits (UT1, UT2, UB1, USA, UDA and ULL, plus UT3 and UB2). If the channel transfer is continuous/infinite, no event is generated.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C3BR1</name>
          <displayName>GPDMA_C3BR1</displayName>
          <description>GPDMA channel 3 block register 1 </description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BNDT</name>
              <description>Block size transferred from the source. When the channel is enabled, this field becomes read-only and is decremented, indicating the remaining number of data items in the current source block to be transferred. BNDT[15:0] is programmed in number of bytes, maximum source block size is 64 Kbytes -1.
Once the last data transfer is completed (BNDT[15:0] = 0):
- if GPDMA_C3LLR.UB1 = 1, this field is updated by the LLI in the memory.
- if GPDMA_C3LLR.UB1 = 0 and if there is at least one not null Uxx update bit, this field is internally restored to the programmed value.
- if all GPDMA_C3LLR.Uxx = 0 and if GPDMA_C3LLR.LA[15:0] is not equal to  0, this field is internally restored to the programmed value (infinite/continuous last LLI).
- if GPDMA_C3LLR = 0, this field is kept as zero following the last LLI data transfer.
Note: A non-null source block size must be a multiple of the source data width (BNDT[2:0] versus GPDMA_C3TR1.SDW_LOG2[1:0]). Else a user setting error is reported and no transfer is issued.
+: When configured in packing mode (GPDMA_C3TR1.PAM[1] = 1 and destination data width different from source data width), a non-null source block size must be a multiple of the destination data width (BNDT[2:0] versus GPDMA_C3TR1.DDW_LOG2[1:0]). Else a user setting error is reported and no transfer is issued.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C3SAR</name>
          <displayName>GPDMA_C3SAR</displayName>
          <description>GPDMA channel 3 source address register </description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SA</name>
              <description>This field is the pointer to the address from which the next data is read.
During the channel activity, depending on the source addressing mode (GPDMA_C3TR1.SINC), this field is kept fixed or incremented by the data width (GPDMA_C3TR1.SDW_LOG2[1:0]) after each burst source data, reflecting the next address from which data is read.
During the channel activity, this address is updated after each completed source burst, consequently to:
- the programmed source burst; either in fixed addressing mode or in contiguous-data incremented mode. If contiguously incremented (GPDMA_C3TR1.SINC = 1), then the additional address offset value is the programmed burst size, as defined by GPDMA_C3TR1.SBL_1[5:0] and GPDMA_C3TR1.SDW_LOG2[21:0]
- the additional source incremented/decremented offset value as programmed by GPDMA_C3BR1.SDEC and GPDMA_CxTR3.SAO[12:0].
- once/if completed source block transfer, for a channel 3 with 2D addressing capability (x = 12 to 15). additional block repeat source incremented/decremented offset value as programmed by GPDMA_C3BR1.BRSDEC and GPDMA_CxBR2.BRSAO[15:0]
In linked-list mode, after a LLI data transfer is completed, this register is automatically updated by GPDMA from the memory, provided the LLI is set with GPDMA_C3LLR.USA = 1.
Note: A source address must be aligned with the programmed data width of a source burst (SA[2:0] versus GPDMA_C3TR1.SDW_LOG2[1:0]). Else, a user setting error is reported and no transfer is issued.
+: When the source block size is not a multiple of the source burst size and is a multiple of the source data width, the last programmed source burst is not completed and is internally shorten to match the block size. In this case, the additional GPDMA_CxTR3.SAO[12:0] is not applied.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C3DAR</name>
          <displayName>GPDMA_C3DAR</displayName>
          <description>GPDMA channel 3 destination address register </description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DA</name>
              <description>This field is the pointer to the address from which the next data is written.
During the channel activity, depending on the destination addressing mode (GPDMA_C3TR1.DINC), this field is kept fixed or incremented by the data width (GPDMA_C3TR1.DDW_LOG2[21:0]) after each burst destination data, reflecting the next address from which data is written.
During the channel activity, this address is updated after each completed destination burst, consequently to:
- the programmed destination burst; either in fixed addressing mode or in contiguous-data incremented mode. If contiguously incremented (GPDMA_C3TR1.DINC = 1), then the additional address offset value is the programmed burst size, as defined by GPDMA_C3TR1.DBL_1[5:0] and GPDMA_C3TR1.DDW_LOG2[1:0]
- the additional destination incremented/decremented offset value as programmed by GPDMA_C3BR1.DDEC and GPDMA_CxTR3.DAO[12:0].
- once/if completed destination block transfer, for a channel 3 with 2D addressing capability (x=12to15), the additional block repeat destination incremented/decremented offset value as programmed by GPDMA_C3BR1.BRDDEC and GPDMA_CxBR2.BRDAO[15:0]
In linked-list mode, after a LLI data transfer is completed, this register is automatically updated by the GPDMA from the memory, provided the LLI is set with GPDMA_C3LLR.UDA = 1.
Note: A destination address must be aligned with the programmed data width of a destination burst (DA[2:0] versus GPDMA_C3TR1.DDW_LOG2[1:0]). Else, a user setting error is reported and no transfer is issued.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
