ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U335.svd
Unprivileged write to this bit is ignored if PRIV27 bit is set in GTZC1_MPCBB1_PRIVCFGR2.
Writes are ignored if SPLCK2 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 27, belonging to super-block 2. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 27, belonging to super-block 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC28</name>
              <description>Security configuration for block 28

Unprivileged write to this bit is ignored if PRIV28 bit is set in GTZC1_MPCBB1_PRIVCFGR2.
Writes are ignored if SPLCK2 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 28, belonging to super-block 2. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 28, belonging to super-block 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC29</name>
              <description>Security configuration for block 29

Unprivileged write to this bit is ignored if PRIV29 bit is set in GTZC1_MPCBB1_PRIVCFGR2.
Writes are ignored if SPLCK2 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 29, belonging to super-block 2. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 29, belonging to super-block 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC30</name>
              <description>Security configuration for block 30

Unprivileged write to this bit is ignored if PRIV30 bit is set in GTZC1_MPCBB1_PRIVCFGR2.
Writes are ignored if SPLCK2 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 30, belonging to super-block 2. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 30, belonging to super-block 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC31</name>
              <description>Security configuration for block 31

Unprivileged write to this bit is ignored if PRIV31 bit is set in GTZC1_MPCBB1_PRIVCFGR2.
Writes are ignored if SPLCK2 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 31, belonging to super-block 2. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 31, belonging to super-block 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTZC1_MPCBB1_SECCFGR3</name>
          <displayName>GTZC1 SRAM1 MPCBB security configuration for super-block 3 register</displayName>
          <description>The given reset value is valid when TZEN=1. The reset value is 0x00000000 when TZEN=0.
Write access to this register is secure only. Any read is allowed.
The maximum number of super blocks depends on the device</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC0</name>
              <description>Security configuration for block 0

Unprivileged write to this bit is ignored if PRIV0 bit is set in GTZC1_MPCBB1_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 0, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 0, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC1</name>
              <description>Security configuration for block 1

Unprivileged write to this bit is ignored if PRIV1 bit is set in GTZC1_MPCBB1_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 1, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 1, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC2</name>
              <description>Security configuration for block 2

