ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U335.svd
Unprivileged write to this bit is ignored if PRIV9 bit is set in GTZC1_MPCBB1_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 9, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 9, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC10</name>
              <description>Security configuration for block 10

Unprivileged write to this bit is ignored if PRIV10 bit is set in GTZC1_MPCBB1_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 10, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 10, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC11</name>
              <description>Security configuration for block 11

Unprivileged write to this bit is ignored if PRIV11 bit is set in GTZC1_MPCBB1_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 11, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 11, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC12</name>
              <description>Security configuration for block 12

Unprivileged write to this bit is ignored if PRIV12 bit is set in GTZC1_MPCBB1_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 12, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 12, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC13</name>
              <description>Security configuration for block 13

Unprivileged write to this bit is ignored if PRIV13 bit is set in GTZC1_MPCBB1_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 13, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 13, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC14</name>
              <description>Security configuration for block 14

Unprivileged write to this bit is ignored if PRIV14 bit is set in GTZC1_MPCBB1_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 14, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 14, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC15</name>
              <description>Security configuration for block 15

Unprivileged write to this bit is ignored if PRIV15 bit is set in GTZC1_MPCBB1_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 15, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 15, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC16</name>
              <description>Security configuration for block 16

