ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U335.svd
Non-secure write to this bit is ignored if SEC0 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 0, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 0, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV1</name>
              <description>Privileged configuration for block 1, belonging to super-block 1

Non-secure write to this bit is ignored if SEC1 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 1, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 1, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV2</name>
              <description>Privileged configuration for block 2, belonging to super-block 1

Non-secure write to this bit is ignored if SEC2 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 2, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 2, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV3</name>
              <description>Privileged configuration for block 3, belonging to super-block 1

Non-secure write to this bit is ignored if SEC3 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 3, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 3, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV4</name>
              <description>Privileged configuration for block 4, belonging to super-block 1

Non-secure write to this bit is ignored if SEC4 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 4, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 4, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV5</name>
              <description>Privileged configuration for block 5, belonging to super-block 1

Non-secure write to this bit is ignored if SEC5 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 5, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 5, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV6</name>
              <description>Privileged configuration for block 6, belonging to super-block 1

Non-secure write to this bit is ignored if SEC6 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 6, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 6, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV7</name>
              <description>Privileged configuration for block 7, belonging to super-block 1

