ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U335.svd
Non-secure write to this bit is ignored if SEC27 bit is set in GTZC1_MPCBB2_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 27, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 27, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV28</name>
              <description>Privileged configuration for block 28, belonging to super-block 0

Non-secure write to this bit is ignored if SEC28 bit is set in GTZC1_MPCBB2_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 28, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 28, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV29</name>
              <description>Privileged configuration for block 29, belonging to super-block 0

Non-secure write to this bit is ignored if SEC29 bit is set in GTZC1_MPCBB2_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 29, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 29, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV30</name>
              <description>Privileged configuration for block 30, belonging to super-block 0

Non-secure write to this bit is ignored if SEC30 bit is set in GTZC1_MPCBB2_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 30, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 30, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV31</name>
              <description>Privileged configuration for block 31, belonging to super-block 0

Non-secure write to this bit is ignored if SEC31 bit is set in GTZC1_MPCBB2_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 31, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 31, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTZC1_MPCBB2_PRIVCFGR1</name>
          <displayName>GTZC1 SRAM2 MPCBB privileged configuration for super-block 1 register</displayName>
          <description>The given reset value is valid when TZEN=1. The reset value is 0x00000000 when TZEN=0.
Write access to this register is privileged only. Any read is allowed.</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIV0</name>
              <description>Privileged configuration for block 0, belonging to super-block 1

Non-secure write to this bit is ignored if SEC0 bit is set in GTZC1_MPCBB2_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 0, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 0, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV1</name>
              <description>Privileged configuration for block 1, belonging to super-block 1

Non-secure write to this bit is ignored if SEC1 bit is set in GTZC1_MPCBB2_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 1, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 1, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV2</name>
              <description>Privileged configuration for block 2, belonging to super-block 1

